Revit 2027 API
ExternalCommandData.View Property
 Retrieves an object that represents the View external command work on.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public View View { get; set; }
Public Property View As View
	Get
	Set
public:
property View^ View {
	View^ get ();
	void set (View^ value);
}
member View : View with get, set
Property Value
View
See Also
Reference
ExternalCommandData Class
Autodesk.Revit.UI Namespace